---
kind: property
id: P:Autodesk.Revit.DB.ColorFillSchemeEntry.IsVisible
source: html/cc94771f-3261-3642-67a3-3b6733afeb6d.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.IsVisible Property

Represents if the element colored based on this entry is visible in views.

## Syntax (C#)
```csharp
public bool IsVisible { get; set; }
```